{"config": [{"config": {"output_shape_type": "raw", "input_dtype": "float32", "output_shape": null, "function_type": "lambda", "trainable": true, "arguments": {}, "batch_input_shape": [null, 32, 32, 1], "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000C\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e7\u0000\u0000\u0000\u0000\u0000\u00e0_@\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\bmodel.py\u00da\b<lambda>\u00a3\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "name": "lambda_1"}, "class_name": "Lambda"}, {"config": {"bias": true, "activation": "relu", "nb_col": 3, "dim_ordering": "tf", "input_dtype": "float32", "trainable": true, "subsample": [1, 1], "b_constraint": null, "W_regularizer": null, "nb_filter": 16, "W_constraint": null, "init": "glorot_uniform", "b_regularizer": null, "border_mode": "valid", "nb_row": 3, "batch_input_shape": [null, 32, 32, 1], "name": "convolution2d_1", "activity_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"strides": [4, 4], "dim_ordering": "tf", "pool_size": [4, 4], "trainable": true, "border_mode": "valid", "name": "maxpooling2d_1"}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "name": "dropout_1", "p": 0.3}, "class_name": "Dropout"}, {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"bias": true, "activation": "linear", "output_dim": 1, "trainable": true, "b_regularizer": null, "b_constraint": null, "W_regularizer": null, "activity_regularizer": null, "W_constraint": null, "init": "glorot_uniform", "input_dim": 784, "name": "dense_1"}, "class_name": "Dense"}], "class_name": "Sequential", "keras_version": "1.2.1"}