{"keras_version": "1.2.1", "config": [{"config": {"function_type": "lambda", "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000C\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003Ng\u0000\u0000\u0000\u0000\u0000\u00e0_@g\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0001\u0000\u0000\u0000r\u0001\u0000\u0000\u0000\u00fa\u001f<ipython-input-15-4a94c9ea1779>\u00da\b<lambda>\t\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "batch_input_shape": [null, 32, 32, 1], "output_shape": null, "arguments": {}, "input_dtype": "float32", "output_shape_type": "raw", "name": "lambda_1", "trainable": true}, "class_name": "Lambda"}, {"config": {"W_constraint": null, "nb_filter": 2, "b_regularizer": null, "activation": "relu", "name": "convolution2d_1", "bias": true, "border_mode": "valid", "dim_ordering": "tf", "init": "glorot_uniform", "batch_input_shape": [null, 32, 32, 1], "nb_col": 3, "activity_regularizer": null, "nb_row": 3, "W_regularizer": null, "input_dtype": "float32", "b_constraint": null, "subsample": [1, 1], "trainable": true}, "class_name": "Convolution2D"}, {"config": {"strides": [4, 4], "pool_size": [4, 4], "dim_ordering": "tf", "name": "maxpooling2d_1", "border_mode": "valid", "trainable": true}, "class_name": "MaxPooling2D"}, {"config": {"p": 0.3, "name": "dropout_1", "trainable": true}, "class_name": "Dropout"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"init": "glorot_uniform", "b_regularizer": null, "activation": "linear", "input_dim": 98, "W_constraint": null, "bias": true, "activity_regularizer": null, "W_regularizer": null, "name": "dense_1", "output_dim": 1, "b_constraint": null, "trainable": true}, "class_name": "Dense"}], "class_name": "Sequential"}